{"sections":{"main":{"type":"main-page","disabled":true,"custom_css":[],"settings":{"show_title":true,"title_alignment":"center"}},"image_with_text_overlay_thTnQh":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/Old_wooden_gate.jpg","image_link":"","height":"adapt","height_desktop":600,"height_mobile":500,"color_overlay_bg":"#ffffff","overlay_opacity":80,"color_overlay_text":"#333333","text_alignment":"center","overlay_position_x":50,"overlay_position_y":50,"mobile_text_below":false,"overlay_title":"Ruby's Guide to Maintaining Redwood Entrance Gates","enlarge_title":false,"overlay_title_width":100,"styled_words":"","words_style":"stencil","highlight_words_top":10,"highlight_color":"#ffffff","styled_word_color":"#b5e0fa","overlay_text":"","enlarge_text":false,"overlay_url_text_1":"","overlay_url_1":"","overlay_url_text_2":"","overlay_url_2":"","overlay_url_style":"button_1","color_label_background":"#ffffff","color_label_text":"#333333","show_chevron":true,"product_id_1":"","chevron_position_1":"right","label_position_x_1":20,"label_position_y_1":30,"product_id_2":"","chevron_position_2":"right","label_position_x_2":80,"label_position_y_2":50}},"rich_text_n6QT4q":{"type":"rich-text","settings":{"title":"","text":"<h4><strong>Proper maintenance of your Redwood entrance gates is essential to ensure their longevity, functionality, and aesthetic appeal. Regular upkeep not only enhances the appearance of your property but also prevents potential issues such as warping, swelling, or structural damage.<\/strong><\/h4>","button_label":"","button_link":"","vertical_alignment":"center","url_style":"button_1","enlarge_title":false,"enlarge_text":false,"full_width":false,"color_title":"#333333","color_text":"#333333","color_bg":"#f3f5f6","gradient_bg":"","custom_padding":true,"padding_top":0,"padding_bottom":0}},"collapsible_tabs_d9iqjm":{"type":"collapsible-tabs","blocks":{"question_nGipee":{"type":"question","settings":{"title":"Step 1: Regular Cleaning","answer":"<p>Over time, gates can accumulate dirt, dust, and environmental debris, which may impact their appearance and durability. To maintain cleanliness:<\/p><ul><li><strong>Rinse<\/strong>: Use a hose to remove loose dirt and debris.<\/li><li><strong>Scrub<\/strong>: Gently scrub the surface with a soft brush or cloth using a mixture of warm water and mild detergent. Avoid abrasive tools or harsh chemicals that could damage the finish.<\/li><li><strong>Rinse Again<\/strong>: Thoroughly rinse with clean water and allow the gate to air dry.<\/li><\/ul><p>For areas affected by mould, mildew, or algae, apply a diluted mixture of water and white vinegar, or use a specialist cleaner suitable for timber gates.<\/p>"}},"question_AAPciK":{"type":"question","settings":{"title":"Step 2: Protective Treatments","answer":"<p>Wooden gates are susceptible to damage from UV rays and moisture. Applying protective treatments can safeguard against these elements:<\/p><ul><li><strong>UV Protection<\/strong>: Apply a UV-resistant stain or oil, such as Osmo UV Protection Oil, to shield the wood from sun damage and maintain its natural colour. Reapply every 6 to 12 months, depending on exposure.<\/li><\/ul><p><strong>Moisture Resistance<\/strong>: Ensure all joints and end grains are sealed to prevent water ingress, which can lead to swelling or rot. Regularly inspect and reapply water-repellent treatments as needed.<\/p><p><\/p>"}}},"block_order":["question_nGipee","question_AAPciK"],"settings":{"title":""}},"collapsible_tabs_TigwmK":{"type":"collapsible-tabs","blocks":{"question_6HUMME":{"type":"question","settings":{"title":"Step 3: Hardware Inspection","answer":"<p>The functionality of your gate heavily depends on its hardware. Regularly check:<\/p><ul><li><strong>Hinges and Latches<\/strong>: Ensure they are free from rust and operate smoothly. Lubricate moving parts and tighten any loose screws or bolts.<\/li><\/ul><p><strong>Structural Integrity<\/strong>: Inspect for signs of wear or damage. Replace any compromised components promptly to maintain gate stability.<\/p>"}},"question_GQkkCN":{"type":"question","settings":{"title":"Step 4: Preventing Warping and Sagging","answer":"<p>Wooden gates can warp or sag due to environmental factors. To minimise this:<\/p><ul><li><strong>Proper Support<\/strong>: Install drop bolts at the bottom of each gate leaf and a top fastening system like a throw-over loop to prevent movement and misalignment.<\/li><li><strong>Even Treatment Application<\/strong>: When applying finishes, treat both sides of the gate simultaneously to prevent uneven drying, which can cause warping.<\/li><\/ul>"}},"question_nzT4Ah":{"type":"question","settings":{"title":"Step 5: Seasonal Maintenance","answer":"<p>Conduct thorough inspections and maintenance at least once a year, preferably in autumn, to prepare for harsh winter conditions:<\/p><ul><li><strong>Clean and Treat<\/strong>: Perform a deep clean and apply necessary protective treatments.<\/li><\/ul><p><strong>Debris Removal<\/strong>: Clear any buildup of leaves, stones, or other debris around the gate to prevent moisture retention and potential rot.<\/p><p><\/p>"}},"question_PVhxm9":{"type":"question","settings":{"title":"Automated Gate Maintenance","answer":"<p>If your gates have been automated by a 3rd party, consult your automation manufacturer or installer for maintenance advice. We do not provide automation systems, so it’s essential to follow their guidance for safe and reliable operation. Regular inspections, cleaning, and servicing by a qualified technician are recommended.<\/p>"}}},"block_order":["question_6HUMME","question_GQkkCN","question_nzT4Ah","question_PVhxm9"],"settings":{"title":""}},"product_list_gQBQUc":{"type":"product-list","settings":{"title":"Osmo Protective Finishes","enlarge_title":true,"link_text":"Shop now","link_url":"","product_list":["osmo-brush-and-roller-set","uv-protection-oil","osmo-wr-base-coat","osmo-end-grain-sealing-wax-375ml"],"show_vendor":false,"enable_carousel":false,"grid":4,"grid_mobile":"2"}},"collapsible_tabs_EUXKm9":{"type":"collapsible-tabs","blocks":{"question_ptqcKf":{"type":"question","settings":{"title":"Moisture & Humidity","answer":"<p>One of the primary reasons gates, especially wooden ones, warp is due to changes in moisture and humidity. Wood absorbs and loses moisture from the environment, causing it to expand and contract.<\/p><p>If one side of the gate is exposed to more moisture than the other, uneven swelling or shrinking occurs, leading to warping.<\/p>"}},"question_pqpfw9":{"type":"question","settings":{"title":"Temperature Fluctuations","answer":"<p>Extreme temperature changes can cause materials to expand and contract. Metal gates, for example, can warp when exposed to direct sunlight followed by cooler temperatures at night. The differential expansion and contraction create stress within the material, resulting in warping.<\/p>"}},"question_7cN9VQ":{"type":"question","settings":{"title":"Improper Installation","answer":"<p>Gates that are not properly installed are more prone to warping. If a gate is not hung level or if the frame is not square, it can place undue stress on certain parts of the gate. Over time, this stress can cause the gate to twist or bend out of shape.<\/p>"}},"question_Yzhdff":{"type":"question","settings":{"title":"Inadequate Support","answer":"<p>Without proper support, gates are susceptible to sagging and warping. Large or heavy gates need additional structural support to maintain their shape. Unsupported sections can warp due to their own weight or external forces like wind<\/p>"}}},"block_order":["question_ptqcKf","question_pqpfw9","question_7cN9VQ","question_Yzhdff"],"custom_css":[],"settings":{"title":"Why do Redwood gates warp?"}},"collapsible_tabs_Lq6bWm":{"type":"collapsible-tabs","blocks":{"question_CfBQtA":{"type":"question","settings":{"title":"Supporting your gate properly","answer":"<p>Proper support is essential for ensuring your gates don't warp over time. All gates must be secured at both the top and bottom to prevent twisting or warping. When installing single or double gates, it's crucial to use a drop bolt at the bottom of each gate leaf and a top fastening system to ensure stability. For double gates, use a drop bolt on each gate leaf and a throwover loop at the top to securely fasten both gate leaves together. This system ensures both gates stay aligned and prevents them from twisting or misaligning over time.<\/p>"}},"question_MC774b":{"type":"question","settings":{"title":"Drop Bolts","answer":"<p>Drop bolts are essential for double gates, providing stability by anchoring each gate leaf to the ground to prevent movement, sagging, or misalignment. For optimal functionality and security, it’s recommended to install one drop bolt per leaf. This ensures both leaves remain firmly in place, whether in the open or closed position, while also allowing flexibility for partial opening and enhanced overall gate stability<\/p>"}},"question_QLpAdz":{"type":"question","settings":{"title":"Proper Application Technique for Even Treatment","answer":"<p>When applying stain or oil, it’s critical to treat both sides of the gate evenly. Avoid applying the finish to one side and letting it dry before treating the other. Uneven drying creates surface tension that can lead to warping as the untreated side absorbs moisture. By applying the stain to both sides in succession, you maintain balance in the wood’s moisture absorption. <\/p><p>Always apply any protective stain or oil in the direction of the wood grain. This method ensures that the treatment is absorbed evenly and enhances the natural beauty of the wood. Applying against the grain can lead to blotchy finishes and inconsistent protection.<\/p>"}},"question_KPHdtn":{"type":"question","settings":{"title":"End Grain Protection","answer":"<p>The end grain of the wood is particularly vulnerable to moisture, which can cause it to absorb water quickly. This leads to swelling and potential damage. Pay special attention to coating the end grain thoroughly during the staining or oiling process to ensure it remains sealed and protected.<\/p>"}},"question_76FRqE":{"type":"question","settings":{"title":"Don't Forget the Bottom Edge","answer":"<p>One of the most commonly overlooked areas during treatment is the bottom edge of the gate. Leaving this area untreated allows moisture to be absorbed from the ground, which can result in swelling, rotting, and eventual breakdown of the gate. Modern wood treatments are designed to protect all surfaces while allowing the wood to breathe, so ensure the bottom edge is properly sealed.<\/p>"}},"question_DbQayE":{"type":"question","settings":{"title":"Choosing the Right Hinges","answer":"<p>Choosing the right hinges is just as important as any other part of the installation. Here are some guidelines:<\/p><ul><li><strong>Tee Hinges<\/strong> should be at least half the width of the gate to provide adequate support.<\/li><li><strong>Bands and Hooks<\/strong> should be one-third the width of the gate to ensure long-term stability and ease of movement.<\/li><\/ul>"}}},"block_order":["question_CfBQtA","question_MC774b","question_QLpAdz","question_KPHdtn","question_76FRqE","question_DbQayE"],"settings":{"title":"How do I prevent my Redwood gate warping?"}},"featured_collection_bq9qTM":{"type":"featured-collection","settings":{"title":"Drop Bolts and Throwover Loops","enlarge_title":false,"link_text":"","collection":"ruby-uk-bolts-and-throwover","show_vendor":false,"enable_carousel":false,"grid":3,"row_count":1,"grid_mobile":"2"}},"multi_column_gDmwLx":{"type":"multi-column","custom_css":[],"settings":{"title":"","enlarge_title":false,"text_alignment":"center","custom_image_height":true,"image_height":270,"url_style":"button_1","enable_custom_colors":false,"color_title":"","color_text":"","color_bg":"#ffffff","gradient_bg":""}},"multi_column_PKwN4B":{"type":"multi-column","settings":{"title":"","enlarge_title":false,"text_alignment":"center","custom_image_height":true,"image_height":270,"url_style":"button_1","enable_custom_colors":false,"color_title":"","color_text":"","color_bg":"#ffffff","gradient_bg":""}}},"order":["main","image_with_text_overlay_thTnQh","rich_text_n6QT4q","collapsible_tabs_d9iqjm","collapsible_tabs_TigwmK","product_list_gQBQUc","collapsible_tabs_EUXKm9","collapsible_tabs_Lq6bWm","featured_collection_bq9qTM","multi_column_gDmwLx","multi_column_PKwN4B"]}