{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_title":true,"title_alignment":"center"}},"rich_text_CpWVPJ":{"type":"rich-text","settings":{"title":"{{ page.title }}","text":"","button_label":"","button_link":"","vertical_alignment":"center","url_style":"button_1","enlarge_title":false,"enlarge_text":false,"full_width":false,"color_title":"#333333","color_text":"#333333","color_bg":"rgba(0,0,0,0)","gradient_bg":"","custom_padding":true,"padding_top":0,"padding_bottom":14}},"image_with_text_overlay_AyNXky":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/3x3_Apex_Open_Roof_Lifestyle_Day.png","image_link":"","height":"fixed","height_desktop":360,"height_mobile":340,"color_overlay_bg":"#ffffff","overlay_opacity":80,"color_overlay_text":"#333333","text_alignment":"center","overlay_position_x":50,"overlay_position_y":70,"mobile_text_below":false,"overlay_title":"","enlarge_title":false,"overlay_title_width":100,"styled_words":"","words_style":"stencil","highlight_words_top":10,"highlight_color":"#ffffff","styled_word_color":"#b5e0fa","overlay_text":"","enlarge_text":false,"overlay_url_text_1":"","overlay_url_1":"","overlay_url_text_2":"","overlay_url_2":"","overlay_url_style":"button_1","color_label_background":"#ffffff","color_label_text":"#333333","show_chevron":true,"product_id_1":"","chevron_position_1":"right","label_position_x_1":20,"label_position_y_1":30,"product_id_2":"","chevron_position_2":"right","label_position_x_2":80,"label_position_y_2":50}},"rich_text_n6QT4q":{"type":"rich-text","settings":{"title":"Buying a Pergola","text":"<p>Elevate your outdoor space or garden with our beautiful range of <a href=\"\/collections\/pergola\" title=\"Pergolas\">Pergolas and Gazebos<\/a>, a versatile collection that is a perfect addition to any hot tub area or a much needed shelter in the summer months.<\/p><p>This comprehensive guide is designed to help you in discovering the ideal garden planter for your requirements—whether you're seeking a raised planter for easy access, or a planter with trellis for growing plants, our range offers planters specifically suited to your unique taste, including customisable features.<\/p><p>All of our Pergolas and Gazebos arrive in a user friendly kit form, consisting of precisely pre-cut lengths and an in-depth manual, so it is great for both DIY’ers and professional fitters alike.<\/p><p><\/p>","button_label":"","button_link":"","vertical_alignment":"center","url_style":"button_1","enlarge_title":false,"enlarge_text":false,"full_width":false,"color_title":"#333333","color_text":"#333333","color_bg":"rgba(0,0,0,0)","gradient_bg":"","custom_padding":true,"padding_top":20,"padding_bottom":0}},"custom_table_section_FxpWnt":{"type":"custom_table_section","blocks":{"cstm_tables_row_TPNfdJ":{"type":"cstm_tables_row","settings":{"cstm_tables_text1":"<p><strong>What style of pergola are you after?<\/strong><\/p>","cstm_tables_text2":"<p><strong>What budget do you have in mind?<\/strong><\/p>","cstm_tables_text3":"<p><strong>What type of roof would you like?<\/strong><\/p>"}},"cstm_tables_row_hjgJM3":{"type":"cstm_tables_row","settings":{"cstm_tables_text1":"<p><\/p><p><\/p><p><\/p><p><\/p><p><strong>Apex Pergola<\/strong><\/p><p><\/p><p>An <a href=\"\/collections\/apex-pergola\" title=\"Apex Pergola\">Apex Pergola<\/a> type of Pergola that features a peaked or apex roof design. This apex structure forms a triangle at the top of the pergola, creating a distinct, sharp point that can add a dynamic architectural element to a garden or outdoor space.<\/p><p>Not only does the design have an enhanced visual appeal, but also offers practical benefits such as improved water runoff, making it less likely for water to accumulate on the roof, which can be especially useful in areas with heavier rainfall. <\/p>","cstm_tables_text2":"<p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><strong>High Budget<\/strong><\/p><p><\/p><p>Cedar and Katepal Shingles<\/p><p>For those who have a higher budget, our Premium Cedar or Katepal Shingles are a perfect choice.<\/p><p>Our Cedar Shingle are made from premium British Cedar, known for it natural, golden hues. Cedar is also an extremely durable timber and requires little maintenance. Similarly, our Katepal shingles are long-lasting and are available in a wide range of colour to complement your garden’s aethestics.<\/p>","cstm_tables_text3":"<p><strong>Flat Roof<\/strong><\/p><p>Unlike arched or angled pergolas, <a href=\"\/products\/flat-top-premium-pergolas-frame-only\" title=\"Flat Roofed Pergola - Overhang - Frame Only\">Flat Top Pergolas<\/a> have a level roof, which makes them distinctively modern and minimalist in style. This design provides a straightforward and sleek look, often blending easily with contemporary architecture.<\/p><p>Flat top pergolas are relatively simple to construct and can be easily adapted to fit a variety of spaces, whether large or small. This adaptability makes them a practical choice for many homeowners.<\/p>"}},"cstm_tables_row_XbpaLm":{"type":"cstm_tables_row","settings":{"cstm_tables_text1":"<p><strong>4 Pitch Apex Pergola<\/strong><\/p><p><\/p><p>Our <a href=\"\/collections\/4-pitch-pergola\" title=\"4 Pitch Pergola\">4 Pitch Apex Pergolas<\/a> feature an apex roof that comes to a peak, with four angled sides. This design combines the concept of an apex roof with a more complex, multi-sided structure, leading to an architectural style that is both visually striking and functionally effective.<\/p>","cstm_tables_text2":"<p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><strong>Mid-Range Budget<\/strong><\/p><p>Our Featheredge Pergolas are ideal for those looking for a cheaper alternative to Cedar Shingle, but would still like a Pergola full of rustic charm and appeal.<\/p><p>Our Featheredge Pergolas have a rough sawn finish, seamlessly blending into your garden with little maintenance. Pressure treated for durability and resistance to the elements, our Featheredge Pergolas area great addition for those wanting to level up their garden on a budget.<\/p>","cstm_tables_text3":"<p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><strong>Open Roof<\/strong><\/p><p><\/p><p>With an open roof design, these Pergolas allow plenty of natural sunlight and air to filter through.<\/p><p>And for those who with a love for climbing plants, an open roof pergola provides a perfect structure for plants to grow upon. Plants like vines, ivies, or even some fruits and flowers can weave through the open slats or beams, creating a beautiful, natural canopy over time.<\/p>"}},"cstm_tables_row_G7zeyk":{"type":"cstm_tables_row","settings":{"cstm_tables_text1":"<p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><strong>Lean-To<\/strong><\/p><p><\/p><p>A <a href=\"\/collections\/lean-to-pergola\" title=\"Lean-To Pergola\">Lean-To Pergola<\/a> is attached to an existing structure, such as the side of a house or building. This design uses the wall it is attached to for support on one side, with the other side typically supported by posts or columns. This configuration makes the Lean-To pergola a popular choice for extending the living space of a home into the garden or patio area.<\/p><p>Lean-To pergolas are effective for creating covered areas that provide shade and protection from the elements while still maintaining an open and airy feel.<\/p>","cstm_tables_text2":"<p><strong>Low Budget<\/strong><\/p><p><\/p><p>Our Corrapol Roof Pergolas are a great option for those on a lower budget.<\/p><p>Corrapol is a brand of corrugated roofing sheets - known for their durability, lightweight properties, and ease of installation, making them a popular choice for both residential and commercial applications.<\/p><p>The translucent sheets also maximise sunlight, making this option perfect for those wanting a shelter that does not compromise on natural light. <\/p>","cstm_tables_text3":"<p><strong>Closed Roof<\/strong><\/p><p><\/p><p>Closed roof pergolas are perfect for providing protection from the elements - it shields those underneath from rain, harsh sunlight, and even snow, making the outdoor space usable regardless of weather conditions or time of year. <\/p><p>Closed roof pergola can provide a sense of seclusion and privacy, making it an ideal choice for urban areas or anywhere close quarters might make an open design less appealing. <\/p>"}}},"block_order":["cstm_tables_row_TPNfdJ","cstm_tables_row_hjgJM3","cstm_tables_row_XbpaLm","cstm_tables_row_G7zeyk"],"settings":{"bg_color":"#eaeaea","cstm_table_head":"Things to consider","padding_top":10,"padding_bottom":20}},"custom_collapsible_tabs_y4Tgr6":{"type":"custom_collapsible_tabs","blocks":{"question_dDMTR7":{"type":"question","settings":{"title":"Cedar Shingle Roof","answer":"<p>Expertly crafted with a high-quality British Cedar roof and a robust structure made from a pressure-treated Larch and Spruce mix, this Pergola exudes rustic charm.<\/p><p>Designed to stand the test of time, this pergola combines durability with minimal maintenance, ideal for those with busy lifestyles. The cedar shingles offer a classic, rustic appearance that enhances the natural beauty of any garden setting with their warm, golden hues. Resistant to rot and decay, the pergola requires little upkeep, allowing you more time to enjoy your outdoor space without the hassle. Whether creating a cozy garden focal point or a stylish area for entertaining, this pergola adds both functional elegance and a touch of rustic charm to your outdoor living space.<\/p>","image_text":"<ul><li><strong>Naturally Durable<\/strong>: With the roof made from high-quality British Cedar, and the structure from pressure-treated Larch\/Spruce mix, you can be sure this pergola would stand the test of time.<\/li><li><strong>Aesthetically Pleasing<\/strong>: Cedar Shingles offer a classic, rustic appearance that is highly valued for outdoor structures. The Cedar timber can beautifully and effortlessly complement a garden setting with it's natural, golden hues.<\/li><li><strong>Little Maintenance: <\/strong>Cedar wood is known for it's natural durability against rot and decay, which means that your Cedar Shingles Pergola require little up-keep and it great for those who lead a busy lifestyle<\/li><\/ul><p><\/p>","image":"shopify:\/\/shop_images\/4Point_CedarShingleRoof_Studio_Var22048.png","button":"Shop Cedar Shingle Roof Pergolas","button_url":"shopify:\/\/collections\/ruby-uk-contemporary-cedar-slatted-fences"}},"question_LTEpaA":{"type":"question","settings":{"title":"Featheredge Roof","answer":"<p>Our Featheredge roof Pergolas blend functionality with rustic charm. Constructed from durable, overlapping timber slats, it provides a shaded retreat in your garden, perfect for relaxing or entertaining. The natural wood finish enhances its traditional appeal, making it a stylish addition to any outdoor space.<\/p>","image_text":"<ul><li><strong>Rustic Appeal: <\/strong>The sawn finish to our Featheredge Pergolas add the perfect rustic charm to your garden, blending seamlessly into any outdoor space<\/li><\/ul><p><\/p><ul><li><strong>Pressure Treated: <\/strong>Our timber is treated thoroughly with TanalithE, ensuring longevity and enhanced protection against the elements<\/li><li><strong>Matching Items<\/strong>: For a cohesive look, we also sell a range of Featheredge fencing solutions, as well as planters and gates - creating a uniform aesthetic for your outdoor areas<\/li><\/ul>","image":"shopify:\/\/shop_images\/Featheredge_Redwood_Studio2048.png","button":"Shop Featheredge Roof Pergolas","button_url":"shopify:\/\/collections\/ruby-uk-larch-slatted-fencing"}},"question_aEPRgj":{"type":"question","settings":{"title":"Cedar Featheredge Roof","answer":"<p>Our Cedar Featheredge roof pergola offers a sturdy and stylish outdoor sanctuary. Its durable cedar construction resists weathering and insects, while the overlapping slats provide ample shade. The natural wood finish complements any garden, making it a perfect blend of functionality and aesthetic appeal.<\/p>","image_text":"<ul><li><strong>Durability<\/strong>: Cedar is naturally resistant to rot, decay, and insect damage, making it an ideal material for outdoor structures.<\/li><li><strong>Aesthetic Appeal<\/strong>: Cedar has a rich, warm colour and a tight grain pattern that enhances the look of any garden or outdoor area.<\/li><li><strong>Little Maintenance<\/strong>: Due to Cedar's natural durability, it typically requires very little maintenance other than UV protection, making it ideal for those with busy lifestyles<\/li><\/ul><p><\/p>","image":"shopify:\/\/shop_images\/LeanTo-FeatheredgeCedar-Studio2048.png","button":"Shop PSE Slatted Panel","button_url":"shopify:\/\/collections\/slatted-fencing"}},"question_tJFKBb":{"type":"question","settings":{"title":"Katepal Shingle Roof","answer":"<p>Discover the modern elegance of our Katepal Shingle Pergolas, available in a wide array of colours to perfectly complement your garden's aesthetic. These shingles feature a contemporary design that elevates any outdoor space, while their bituminous composition provides exceptional water resistance, keeping your pergola dry and protected in any weather. Ideal for those seeking style and functionality in their garden retreat.<\/p>","image_text":"<ul><li><strong>Optional Colours: <\/strong>Available in a wide variety of colours to complement your garden, Katepal shingles allow for customisation to match different architectural styles and personal preferences<\/li><\/ul><p><\/p><ul><li><strong>Modern & Contemporary: <\/strong>Our Katepal Shingles have a gorgeous, modern look and feel, elevating any garden and outdoor space with effortlessly<\/li><li><strong>Water Resistant<\/strong>: The bituminous composition of Katepal shingles offers excellent water resistance, ensuring that the pergola remains dry and protected from rain.<\/li><\/ul>","image":"shopify:\/\/shop_images\/4Point_KatepalShingle_Studio2048_cea17ca7-2821-49ae-954b-9844cfc63c07.png","button":"","button_url":""}},"question_RccGqW":{"type":"question","settings":{"title":"Corrapol Roof","answer":"<p>Enhance your outdoor space with a Corrapol roof pergola, designed for durability and aesthetic appeal. <\/p><p>This lightweight, corrugated roofing offers excellent weather resistance against rain, snow, and UV rays and its translucent feature allows maximum sunlight, while still maintaining cover. Corrapol roofs are cost-effective, require minimal maintenance, and provide a stylish, long-lasting solution for any garden or patio area. <\/p><p>Perfect for those seeking a practical yet attractive outdoor shelter.<\/p>","image_text":"<ul><li><strong>Budget Friendly: <\/strong>Our Corrapol Roof Pergolas provide a cost-effective option compared to more traditional materials like Cedar Shingle or Featheredge timber, without sacrificing performance or appearance<\/li><li><strong>Lightweight & Translucent: <\/strong>The material is relatively lightweight, which simplifies the handling and installation process, reducing both time and labor costs. The translucent features also allows natural light to filter through, while providing protection from direct sunlight - perfect for pergolas used as a relaxation or gathering area<\/li><li><strong>Easy Maintenance<\/strong>: Corrapol roofs require minimal maintenance, as they do not rust, corrode, or require frequent painting or treatments.<\/li><\/ul>","button":"","button_url":""}}},"block_order":["question_dDMTR7","question_LTEpaA","question_aEPRgj","question_tJFKBb","question_RccGqW"],"settings":{"title":"Types of Pergolas","description":"","text_alignment":"center","first_open":false,"padding_top":40,"padding_bottom":40}},"image_with_text_overlay_bJMWgh":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/WhatsApp_Image_2024-03-07_at_08.47.00.jpg","image_link":"","height":"fixed","height_desktop":400,"height_mobile":340,"color_overlay_bg":"#ffffff","overlay_opacity":80,"color_overlay_text":"#333333","text_alignment":"center","overlay_position_x":50,"overlay_position_y":70,"mobile_text_below":false,"overlay_title":"In-House Manufacturing","enlarge_title":false,"overlay_title_width":100,"styled_words":"","words_style":"stencil","highlight_words_top":10,"highlight_color":"#ffffff","styled_word_color":"#b5e0fa","overlay_text":"","enlarge_text":false,"overlay_url_text_1":"","overlay_url_1":"","overlay_url_text_2":"","overlay_url_2":"","overlay_url_style":"button_1","color_label_background":"#ffffff","color_label_text":"#333333","show_chevron":true,"product_id_1":"","chevron_position_1":"right","label_position_x_1":20,"label_position_y_1":30,"product_id_2":"","chevron_position_2":"right","label_position_x_2":80,"label_position_y_2":50}},"multi_column_LnG3wy":{"type":"multi-column","blocks":{"text_block_b7hgK4":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/Ellumiere_-_SSteel_spotlight._1_900x_0385ede0-e268-44a0-9f93-54ffeaa142d7.jpg","image_width":100,"enable_icon":false,"icon":"award","icon_size":48,"icon_color":"","title":"Lighting","text":"<p>For added ambiance, consider adding lighting to your pergola for both day and night enjoyment. Our selection of Ellumiere lighting solutions includes options like an automatic motion-sensor light, ensuring your pergola is both functional and striking.<\/p>","button_label":"","button_link":"","enable_link":false,"enlarge_title":false,"enlarge_text":false}},"text_block_CEUx38":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/osmo_500x_b39e9f10-bd15-4943-aa8b-3494504ae40b.webp","image_width":100,"enable_icon":false,"icon":"award","icon_size":48,"icon_color":"","title":"UV Protection","text":"<p>We always recommend using UV protection on your Pergola, at least every 6-12 months. This ensures your Pergola maintains its beautiful, natural colour and helps protect the timber against decay and the elements.<\/p>","button_label":"","button_link":"shopify:\/\/products\/uv-protection-oil","enable_link":false,"enlarge_title":false,"enlarge_text":false}},"text_block_z64hKP":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/Screenshot2022-08-08at08.53.04_1296x_592aa3b3-0cc2-47b6-8a59-0f1254e85123.webp","image_width":100,"enable_icon":false,"icon":"award","icon_size":48,"icon_color":"","title":"Paint","text":"<p>To match your Pergola seamlessly with your garden’s aesthetic, you can paint your Pergola. We recommend Osmo Paint, as this is water-based and available in various different colours.<\/p>","button_label":"","button_link":"shopify:\/\/products\/osmo-paint-750ml","enable_link":false,"enlarge_title":false,"enlarge_text":false}}},"block_order":["text_block_b7hgK4","text_block_CEUx38","text_block_z64hKP"],"settings":{"title":"Things to consider when using a Pergola","enlarge_title":false,"text_alignment":"center","custom_image_height":false,"image_height":270,"url_style":"button_1","enable_custom_colors":false,"color_title":"","color_text":"","color_bg":"","gradient_bg":""}},"custom_collapsible_tabs_bLR7N4":{"type":"custom_collapsible_tabs","blocks":{"question_NiR7kc":{"type":"question","settings":{"title":"What is the difference between a pergola and a gazebo?","answer":"<p>A pergola is an open structure with a roof made of beams or rafters, offering partial shade while allowing sunlight through. A gazebo, on the other hand, is a fully enclosed structure with a solid roof, providing more complete shelter from the elements.<\/p>","image_text":"","button":"","button_url":""}},"question_6idiqK":{"type":"question","settings":{"title":"Do I need planning permission for a pergola or gazebo?","answer":"<p>In most cases, you do not need planning permission for a pergola or gazebo if it is under a certain height (typically 2.5 meters) and located within your property. <\/p><p>However, it's always advisable to check local regulations or consult your local authority before installation.<\/p>","image_text":"","button":"","button_url":""}},"question_wXLRDf":{"type":"question","settings":{"title":"Can I assemble the pergola or gazebo myself?","answer":"<p>Yes, many of our pergolas and gazebos are designed for DIY assembly with clear instructions included.<\/p><p>However, we also offer professional installation services alongside the product.<\/p>","image_text":"","button":"","button_url":""}},"question_iEbBMK":{"type":"question","settings":{"title":"What materials are your pergolas and gazebos made from?","answer":"<p>Our Pergolas are available in Oak or  Pressure-Treated Redwood frames, with a large variety of different roofing options such as Cedar Featheredge, Katepal Shingles etc.<\/p>","image_text":"","button":"","button_url":""}},"question_L86MMh":{"type":"question","settings":{"title":"Do you offer bespoke pergolas?","answer":"<p>Yes! We can make our Pergola and Gazebos to a bespoke measurement. Simply click 'Order Bespoke' on the product page and enter in your measurements for a price.<\/p><p>Alternatively, contact our Sales team on 01409 231763 for a quote!<\/p>","image_text":"","button":"","button_url":""}},"question_fieGKX":{"type":"question","settings":{"title":"Can I grow plants on my pergola?","answer":"<p>Yes, pergolas are ideal for growing climbing plants like wisteria, ivy, or roses, which can create a natural canopy over time, enhancing the beauty and shade provided by the structure.<\/p>","image_text":"","button":"","button_url":""}}},"block_order":["question_NiR7kc","question_6idiqK","question_wXLRDf","question_iEbBMK","question_L86MMh","question_fieGKX"],"settings":{"title":"Frequently Asked Questions","description":"","text_alignment":"center","first_open":false,"padding_top":40,"padding_bottom":40}},"image_gallery_KwUam6":{"type":"image-gallery","blocks":{"image_6MCxgC":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/pergolabluesky_e1605c21-13e5-4bb8-a078-c226d5f49291.jpg","enlarge_image":false,"link":"shopify:\/\/pages\/guide-to-maintaining-caring-for-pergola-gazebos","title":"Maintenance Guide","text":"<p>Learn expert advice on how to properly care and maintain your Pergola<\/p>","button_label":"","overlay_position":"center-center"}},"image_FAPNpm":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/rubygroup_fieldshelter_generalshots-6_2.jpg","enlarge_image":false,"link":"","title":"Installation Guide","text":"<p>Installing yourself? Follow our in depth, step-by-step installation guide<\/p>","button_label":"","overlay_position":"center-center"}},"image_B8H87R":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/WhatsApp_Image_2024-07-16_at_11.08.41.jpg","enlarge_image":false,"link":"shopify:\/\/blogs\/ruby-tips","title":"Blogs","text":"<p>Stay up to date with the latest tips and trends with our blogs<\/p>","button_label":"","overlay_position":"center-center"}},"image_8eKLkY":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Untitled_design_6.png","enlarge_image":false,"link":"shopify:\/\/pages\/contact-us-1","title":"Customer Service","text":"<p>Not found the answer you need? Contact our team on 01409 231763<\/p>","button_label":"","overlay_position":"center-center"}}},"block_order":["image_6MCxgC","image_FAPNpm","image_B8H87R","image_8eKLkY"],"settings":{"grid":2,"image_height":300,"image_height_mobile":300,"enable_margin":true,"enable_carousel":true,"overlay_style":"box","color_overlay_bg":"#ffffff","overlay_opacity":80,"color_overlay_text":"#333333","overlay_url_style":"button_1"}},"featured_collection_XyzCEn":{"type":"featured-collection","settings":{"title":"Shop our Pergolas & Gazebos","enlarge_title":false,"link_text":"Shop now","collection":"pergola","show_vendor":false,"enable_carousel":false,"grid":4,"row_count":1,"grid_mobile":"2"}}},"order":["main","rich_text_CpWVPJ","image_with_text_overlay_AyNXky","rich_text_n6QT4q","custom_table_section_FxpWnt","custom_collapsible_tabs_y4Tgr6","image_with_text_overlay_bJMWgh","multi_column_LnG3wy","custom_collapsible_tabs_bLR7N4","image_gallery_KwUam6","featured_collection_XyzCEn"]}